УТ_для_edt/src/DataProcessors/смартЗаполнениеТоваровПоНазначению/смартЗаполнениеТоваровПоНазначению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартЗаполнениеТоваровПоНазначению</name>
  <comment>//++ смарт: 31.08.2026 / Заполнить по назначению (вывод из оборота)</comment>
</mdclass:DataProcessor>

УТ_для_edt/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеСоСклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВНаличииГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеСоСкладаГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОтгрузкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОформлениюГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКСборкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобираетсяГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобраноГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/ТипыНазначений/ТипыНазначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНазначений</name>
  <enumValues>
    <name>Собственное</name>
  </enumValues>
  <enumValues>
    <name>Давальческое21</name>
  </enumValues>
  <enumValues>
    <name>ДавальческоеПродукция22</name>
  </enumValues>
  <enumValues>
    <name>ДавальческоеМатериалы22</name>
  </enumValues>
  <enumValues>
    <name>ДавальческоеМатериалыПодЭтап22</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПереработчик</name>
  </enumValues>
  <enumValues>
    <name>смартТоварВыведенныйИзОборота</name>
    <comment>#5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/DataProcessors/смартЗаполнениеТоваровПоНазначению/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Склад", Склад);
	Параметры.Свойство("смартЗапчастиГарантийные", смартЗапчастиГарантийные);
	Параметры.Свойство("ДокументВладелец", ДокументВладелец);
	
	Элементы.Сценарий.СписокВыбора.Очистить();
	Элементы.Сценарий.СписокВыбора.Добавить(Перечисления.ТипыНазначений.смартТоварВыведенныйИзОборота);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		Товары.Очистить();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОстаткиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	АдресВХранилище = ПоместитьВыбранныеСтрокиВоВременноеХранилище();
	Если АдресВХранилище = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отметьте строки для переноса (колонка «Перенести»).'"));
		Возврат;
	КонецЕсли;
	
	Закрыть(АдресВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	
	Товары.Очистить();
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличии,
	|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_ОстаткиНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ТоварыНаСкладахОстатки.Назначение = Назначения.Ссылка
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И Назначения.ТипНазначения = &ТипНазначения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика,
	|	ТоварыНаСкладахОстатки.Склад,
	|	ТоварыНаСкладахОстатки.Назначение,
	|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Характеристика КАК Характеристика,
	|	СвободныеОстатки.Склад КАК Склад,
	|	СвободныеОстатки.ВНаличииОстаток
	|		- СвободныеОстатки.ВРезервеСоСкладаОстаток
	|		- СвободныеОстатки.ВРезервеПодЗаказОстаток КАК СвободноКоммерческое,
	|	СвободныеОстатки.смартВНаличииГарантийныеОстаток
	|		- СвободныеОстатки.смартВРезервеСоСкладаГарантийныеОстаток
	|		- СвободныеОстатки.смартВРезервеПодЗаказГарантийныеОстаток КАК СвободноГарантийное
	|ПОМЕСТИТЬ ВТ_СвободныеОстатки
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(, Склад = &Склад) КАК СвободныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.Склад КАК Склад,
	|	ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
	|	СУММА(
	|		ТоварыКОтгрузкеОстатки.ВРезервеОстаток
	|			+ ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) КАК РезервКоммерческий,
	|	СУММА(
	|		ТоварыКОтгрузкеОстатки.смартВРезервеГарантийныеОстаток
	|			+ ТоварыКОтгрузкеОстатки.смартКОтгрузкеГарантийныеОстаток) КАК РезервГарантийный
	|ПОМЕСТИТЬ ВТ_РезервыКОтгрузке
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОтгрузкеОстатки.Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика,
	|	ТоварыКОтгрузкеОстатки.Склад,
	|	ТоварыКОтгрузкеОстатки.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыДокумента.Номенклатура КАК Номенклатура,
	|	ТоварыДокумента.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВТ_Исключения
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ТоварыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ШапкаПеремещения
	|		ПО ТоварыДокумента.Ссылка = ШапкаПеремещения.Ссылка
	|ГДЕ
	|	ШапкаПеремещения.Проведен
	|	И ШапкаПеремещения.Ссылка <> &ДокументВладелец
	|	И ТоварыДокумента.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И ТоварыДокумента.Назначение.ТипНазначения = &ТипНазначения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Назначение
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТоварыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ШапкаПотребления
	|		ПО ТоварыДокумента.Ссылка = ШапкаПотребления.Ссылка
	|ГДЕ
	|	ШапкаПотребления.Проведен
	|	И ШапкаПотребления.Ссылка <> &ДокументВладелец
	|	И ТоварыДокумента.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И ТоварыДокумента.Назначение.ТипНазначения = &ТипНазначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиНаСкладах.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиНаСкладах.Назначение КАК Назначение,
	|	ВТ_ОстаткиНаСкладах.Склад КАК Склад,
	|	ВТ_ОстаткиНаСкладах.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &Гарантийные
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ОстаткиНаСкладах.ВНаличии < ЕСТЬNULL(ВТ_СвободныеОстатки.СвободноГарантийное, 0)
	|						ТОГДА ВТ_ОстаткиНаСкладах.ВНаличии
	|					ИНАЧЕ ЕСТЬNULL(ВТ_СвободныеОстатки.СвободноГарантийное, 0)
	|				КОНЕЦ - ЕСТЬNULL(ВТ_РезервыКОтгрузке.РезервГарантийный, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_ОстаткиНаСкладах.ВНаличии < ЕСТЬNULL(ВТ_СвободныеОстатки.СвободноКоммерческое, 0)
	|					ТОГДА ВТ_ОстаткиНаСкладах.ВНаличии
	|				ИНАЧЕ ЕСТЬNULL(ВТ_СвободныеОстатки.СвободноКоммерческое, 0)
	|			КОНЕЦ - ЕСТЬNULL(ВТ_РезервыКОтгрузке.РезервКоммерческий, 0)
	|	КОНЕЦ КАК ДоступноеКоличество,
	|	ВТ_ОстаткиНаСкладах.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВТ_ОстаткиНаСкладах КАК ВТ_ОстаткиНаСкладах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
	|		ПО ВТ_ОстаткиНаСкладах.Номенклатура = ВТ_СвободныеОстатки.Номенклатура
	|			И ВТ_ОстаткиНаСкладах.Характеристика = ВТ_СвободныеОстатки.Характеристика
	|			И ВТ_ОстаткиНаСкладах.Склад = ВТ_СвободныеОстатки.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервыКОтгрузке КАК ВТ_РезервыКОтгрузке
	|		ПО ВТ_ОстаткиНаСкладах.Номенклатура = ВТ_РезервыКОтгрузке.Номенклатура
	|			И ВТ_ОстаткиНаСкладах.Характеристика = ВТ_РезервыКОтгрузке.Характеристика
	|			И ВТ_ОстаткиНаСкладах.Склад = ВТ_РезервыКОтгрузке.Склад
	|			И ВТ_ОстаткиНаСкладах.Назначение = ВТ_РезервыКОтгрузке.Назначение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Исключения КАК ВТ_Исключения
	|		ПО ВТ_ОстаткиНаСкладах.Номенклатура = ВТ_Исключения.Номенклатура
	|			И ВТ_ОстаткиНаСкладах.Назначение = ВТ_Исключения.Назначение
	|ГДЕ
	|	ВТ_Исключения.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОстаткиНаСкладах.Номенклатура.Наименование,
	|	ВТ_ОстаткиНаСкладах.Назначение.Наименование";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТипНазначения", Сценарий);
	Запрос.УстановитьПараметр("Гарантийные", смартЗапчастиГарантийные);
	Запрос.УстановитьПараметр("ДокументВладелец", ДокументВладелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ДоступноеКоличество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Перенести = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВыбранныеСтрокиВоВременноеХранилище()
	
	ТаблицаПереноса = Новый ТаблицаЗначений;
	ТаблицаПереноса.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПереноса.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Если Не СтрокаТоваров.Перенести Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПереноса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров, "Номенклатура, Назначение");
		
	КонецЦикла;
	
	Если ТаблицаПереноса.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПереноса, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
